# Заполните массив элементами арифметической прогрессии. Её первый элемент a1 ,
# разность d и количество элементов n будет задано автоматически.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
#
# Пример
#
# На входе:
#
# a1 = 2
# d = 3
# n = 4
# На выходе:
#
# 2
# 5
# 8
# 11

a1 = 2
d = 3
n = 4

for i in range(n):
  print(a1 + i * d)

#
# an = [0] * n
#
# for i in range(n):
#     an = a1 + (i) * d
#     print(an)

#
# N = 5
# A = [0] * N
#
# for i in range(N):
#     A[i] = i + 2 * i
#     print(A[i], end=" ")

